package com.yiwo.friendscometogether.model;

import java.util.List;

import me.zhouzhuo.zzletterssidebar.anotation.Letter;
import me.zhouzhuo.zzletterssidebar.entity.SortModel;

/**
 * Created by Administrator on 2018/9/18.
 */

public class OtherCityModel {

    /**
     * code : 200
     * message : 获取成功
     * obj : [{"id":"100008","name":"马尔代夫"},{"id":"100009","name":"泰国"},{"id":"100010","name":"新加坡"},{"id":"100011","name":"中国"},{"id":"100012","name":"柬埔寨"},{"id":"100013","name":"越南"},{"id":"100014","name":"乌兹别克斯坦"},{"id":"100015","name":"东帝汶"},{"id":"100016","name":"土库曼斯坦"},{"id":"100017","name":"塔吉克斯坦"},{"id":"100018","name":"不丹"},{"id":"100019","name":"吉尔吉斯斯坦"},{"id":"100020","name":"孟加拉国"},{"id":"100021","name":"阿富汗"},{"id":"100022","name":"哈萨克斯坦"},{"id":"100023","name":"巴基斯坦"},{"id":"100024","name":"老挝"},{"id":"100025","name":"朝鲜"},{"id":"100026","name":"文莱"},{"id":"100027","name":"斯里兰卡"},{"id":"100028","name":"印度"},{"id":"100029","name":"尼泊尔"},{"id":"100030","name":"缅甸"},{"id":"100031","name":"印度尼西亚"},{"id":"100032","name":"菲律宾"},{"id":"100033","name":"韩国"},{"id":"100034","name":"日本"},{"id":"100035","name":"马来西亚"},{"id":"100036","name":"圣诞岛"},{"id":"100037","name":"蒙古"},{"id":"100038","name":"阿塞拜疆"},{"id":"100039","name":"亚美尼亚"},{"id":"133797","name":"牟尼沟风景区"},{"id":"133807","name":"九寨沟风景区"},{"id":"133943","name":"穆吉布自然保护区"},{"id":"133975","name":"佩特拉古城"},{"id":"134004","name":"多哈"},{"id":"134096","name":"阿联酋"},{"id":"100040","name":"汤加"},{"id":"100041","name":"澳大利亚"},{"id":"100042","name":"巴布亚新几内亚"},{"id":"100043","name":"图瓦卢"},{"id":"100044","name":"帕劳"},{"id":"100045","name":"纽埃"},{"id":"100046","name":"密克罗尼西亚联邦"},{"id":"100047","name":"所罗门群岛"},{"id":"100048","name":"科科斯（基林）群岛"},{"id":"100049","name":"瑙鲁"},{"id":"100050","name":"基里巴斯共和国"},{"id":"100051","name":"美属萨摩亚"},{"id":"100052","name":"马绍尔群岛"},{"id":"100053","name":"斐济"},{"id":"100054","name":"新西兰"},{"id":"100055","name":"中途岛"},{"id":"100056","name":"马里亚纳群岛"},{"id":"100057","name":"法属波利尼西亚"},{"id":"100058","name":"托克劳群岛"},{"id":"100059","name":"库克群岛"},{"id":"100060","name":"新喀里多尼亚"},{"id":"100061","name":"科科斯群岛"},{"id":"100062","name":"萨摩亚群岛"},{"id":"100063","name":"瓦努阿图"},{"id":"100064","name":"马耳他"},{"id":"100065","name":"卢森堡  "},{"id":"100066","name":"塞尔维亚"},{"id":"100067","name":"法罗群岛"},{"id":"100068","name":"摩尔多瓦"},{"id":"100069","name":"格鲁吉亚"},{"id":"100070","name":"黑山"},{"id":"100071","name":"马其顿"},{"id":"100072","name":"乌克兰"},{"id":"100073","name":"直布罗陀"},{"id":"100074","name":"安道尔"},{"id":"100075","name":"阿尔巴尼亚"},{"id":"100076","name":"白俄罗斯"},{"id":"100077","name":"摩纳哥"},{"id":"100078","name":"保加利亚"},{"id":"100079","name":"克罗地亚"},{"id":"100080","name":"拉脱维亚"},{"id":"100081","name":"立陶宛"},{"id":"100082","name":"罗马尼亚"},{"id":"100083","name":"斯洛文尼亚"},{"id":"100084","name":"波兰"},{"id":"100085","name":"斯洛伐克"},{"id":"100086","name":"塞浦路斯"},{"id":"100087","name":"葡萄牙"},{"id":"100088","name":"匈牙利"},{"id":"100089","name":"挪威"},{"id":"100090","name":"瑞典"},{"id":"100091","name":"冰岛"},{"id":"100092","name":"捷克"},{"id":"100093","name":"芬兰"},{"id":"100094","name":"爱尔兰"},{"id":"100095","name":"俄罗斯"},{"id":"100096","name":"土耳其"},{"id":"100097","name":"丹麦"},{"id":"100098","name":"瑞士"},{"id":"100099","name":"希腊"},{"id":"100100","name":"西班牙"},{"id":"100101","name":"荷兰"},{"id":"100102","name":"奥地利"},{"id":"100103","name":"意大利"},{"id":"100104","name":"德国"},{"id":"100105","name":"法国"},{"id":"100106","name":"比利时"},{"id":"100107","name":"英国"},{"id":"100109","name":"爱沙尼亚"},{"id":"100110","name":"列支敦士登"},{"id":"100111","name":"科索沃"},{"id":"100112","name":"波斯尼亚和黑塞哥维那"},{"id":"134005","name":"梵蒂冈"},{"id":"100113","name":"毛里求斯"},{"id":"100114","name":"埃及"},{"id":"100115","name":"乍得"},{"id":"100116","name":"索马里"},{"id":"100117","name":"马达加斯加"},{"id":"100118","name":"中非共和国"},{"id":"100119","name":"塞拉利昂"},{"id":"100120","name":"尼日尔"},{"id":"100121","name":"加蓬"},{"id":"100122","name":"尼日利亚"},{"id":"100123","name":"厄立特里亚"},{"id":"100124","name":"乌干达"},{"id":"100125","name":"莫桑比克"},{"id":"100126","name":"赤道几内亚"},{"id":"100127","name":"马约特"},{"id":"100128","name":"吉布提"},{"id":"100129","name":"斯威士兰"},{"id":"100130","name":"毛里塔尼亚"},{"id":"100131","name":"科特迪瓦"},{"id":"100132","name":"苏丹"},{"id":"100133","name":"马拉维"},{"id":"100134","name":"马里"},{"id":"100135","name":"佛得角"},{"id":"100136","name":"利比里亚"},{"id":"100137","name":"喀麦隆"},{"id":"100138","name":"莱索托"},{"id":"100139","name":"布隆迪"},{"id":"100140","name":"圣多美和普林西比"},{"id":"100141","name":"布基纳法索"},{"id":"100142","name":"圣赫勒拿"},{"id":"100143","name":"留尼汪岛"},{"id":"100144","name":"几内亚比绍"},{"id":"100145","name":"博茨瓦纳"},{"id":"100146","name":"卢旺达"},{"id":"100147","name":"几内亚"},{"id":"100148","name":"贝宁"},{"id":"100149","name":"加纳"},{"id":"100150","name":"安哥拉"},{"id":"100151","name":"冈比亚"},{"id":"100152","name":"阿尔及利亚"},{"id":"100153","name":"赞比亚"},{"id":"100154","name":"坦桑尼亚"},{"id":"100155","name":"塞舌尔"},{"id":"100156","name":"塞内加尔"},{"id":"100157","name":"纳米尼亚"},{"id":"100158","name":"津巴布韦"},{"id":"100159","name":"刚果（布）"},{"id":"100160","name":"刚果（金）"},{"id":"100161","name":"多哥"},{"id":"100162","name":"摩洛哥"},{"id":"100163","name":"埃塞俄比亚"},{"id":"100164","name":"突尼斯"},{"id":"100165","name":"肯尼亚"},{"id":"100166","name":"南非"},{"id":"100167","name":"西撒哈拉"},{"id":"100168","name":"科摩罗"},{"id":"100169","name":"利比亚"},{"id":"100170","name":"巴哈马"},{"id":"100171","name":"圣卢西亚"},{"id":"100172","name":"圣皮埃尔和密克隆"},{"id":"100173","name":"格陵兰"},{"id":"100174","name":"墨西哥"},{"id":"100175","name":"美国"},{"id":"100176","name":"加拿大"},{"id":"100178","name":"乌拉圭   "},{"id":"100179","name":"玻利维亚    "},{"id":"100180","name":"牙买加"},{"id":"100181","name":"圭亚那"},{"id":"100182","name":"苏里南"},{"id":"100183","name":"福克兰群岛"},{"id":"100184","name":"哥伦比亚"},{"id":"100185","name":"巴拉圭"},{"id":"100186","name":"厄瓜多尔"},{"id":"100187","name":"秘鲁"},{"id":"100188","name":"阿根廷"},{"id":"100189","name":"智利"},{"id":"100190","name":"巴西"},{"id":"100191","name":"委内瑞拉"},{"id":"100193","name":"法属圭亚那"},{"id":"134000","name":"企鹅1"},{"id":"134001","name":"企鹅2"}]
     */

    private int code;
    private String message;
    private List<ObjBean> obj;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<ObjBean> getObj() {
        return obj;
    }

    public void setObj(List<ObjBean> obj) {
        this.obj = obj;
    }

    public static class ObjBean extends SortModel {
        /**
         * id : 100008
         * name : 马尔代夫
         */

        private String id;
        @Letter(isSortField = true)
        private String name;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }
    }
}
